jmeter.log
2026-04-07 01:03:59,410 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-04-07 01:03:59,421 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2026-04-07 01:03:59,421 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2026-04-07 01:03:59,423 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-04-07 01:03:59,423 INFO o.a.j.JMeter: Version 5.6.3
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: java.version=21.0.10
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: os.name=Mac OS X
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: os.arch=aarch64
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: os.version=15.7.4
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: java.awt.headless=true
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: Max memory     =1073741824
2026-04-07 01:03:59,424 INFO o.a.j.JMeter: Available Processors =10
2026-04-07 01:03:59,429 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-04-07 01:03:59,429 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-04-07 01:03:59,429 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2026-04-07 01:03:59,429 INFO o.a.j.JMeter: user.dir  =/Users/shilpasaraf/TestAutomation/sauce-pw
2026-04-07 01:03:59,429 INFO o.a.j.JMeter: PWD       =/Users/shilpasaraf/TestAutomation/sauce-pw
2026-04-07 01:03:59,431 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: Shilpas-MacBook-Pro.local FullName: localhost
2026-04-07 01:03:59,438 INFO o.a.j.s.FileServer: Default base='/Users/shilpasaraf/TestAutomation/sauce-pw'
2026-04-07 01:03:59,438 INFO o.a.j.s.FileServer: Set new base='/Users/shilpasaraf/TestAutomation/sauce-pw'
2026-04-07 01:03:59,525 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-04-07 01:03:59,542 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-04-07 01:03:59,544 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-04-07 01:03:59,545 INFO o.a.j.s.SaveService: Loading file: /Users/shilpasaraf/TestAutomation/sauce-pw/jmeter-script.jmx
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-04-07 01:03:59,575 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-04-07 01:03:59,600 INFO o.a.j.JMeter: Creating summariser <summary>
2026-04-07 01:03:59,610 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-04-07 01:03:59,611 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-07 01:03:59,611 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-07 01:03:59,613 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-04-07 01:03:59,613 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-04-07 01:03:59,644 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-04-07 01:03:59,729 INFO o.a.j.JMeter: Running test (1775520239729)
2026-04-07 01:03:59,738 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Main Thread Group
2026-04-07 01:03:59,738 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Main Thread Group.
2026-04-07 01:03:59,738 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-04-07 01:03:59,739 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-04-07 01:03:59,743 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-1
2026-04-07 01:03:59,753 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Shilpas-MacBook-Pro.local
2026-04-07 01:03:59,757 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-04-07 01:03:59,758 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-04-07 01:03:59,758 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-04-07 01:03:59,758 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-04-07 01:03:59,758 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-04-07 01:03:59,775 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-04-07 01:03:59,775 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-04-07 01:03:59,865 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-04-07 01:03:59,869 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-04-07 01:03:59,869 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-04-07 01:03:59,919 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-04-07 01:03:59,921 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-04-07 01:03:59,921 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-04-07 01:04:00,247 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-2
2026-04-07 01:04:00,314 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.7/s Avg:   518 Min:   518 Max:   518 Err:     1 (100.00%) Active: 2 Started: 2 Finished: 0
2026-04-07 01:04:00,314 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-1
2026-04-07 01:04:00,314 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-1
2026-04-07 01:04:00,620 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-2
2026-04-07 01:04:00,620 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-2
2026-04-07 01:04:00,752 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-3
2026-04-07 01:04:01,055 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-3
2026-04-07 01:04:01,055 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-3
2026-04-07 01:04:01,247 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-4
2026-04-07 01:04:01,591 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-4
2026-04-07 01:04:01,591 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-4
2026-04-07 01:04:01,748 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-5
2026-04-07 01:04:02,054 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-5
2026-04-07 01:04:02,054 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-5
2026-04-07 01:04:02,249 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-6
2026-04-07 01:04:02,591 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-6
2026-04-07 01:04:02,592 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-6
2026-04-07 01:04:02,747 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-7
2026-04-07 01:04:03,120 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-7
2026-04-07 01:04:03,120 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-7
2026-04-07 01:04:03,249 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-8
2026-04-07 01:04:03,580 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-8
2026-04-07 01:04:03,580 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-8
2026-04-07 01:04:03,749 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-9
2026-04-07 01:04:04,247 INFO o.a.j.t.JMeterThread: Thread started: Main Thread Group 1-10
2026-04-07 01:04:04,696 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-9
2026-04-07 01:04:04,696 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-9
2026-04-07 01:04:05,023 INFO o.a.j.t.JMeterThread: Thread is done: Main Thread Group 1-10
2026-04-07 01:04:05,023 INFO o.a.j.t.JMeterThread: Thread finished: Main Thread Group 1-10
2026-04-07 01:04:05,023 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-04-07 01:04:05,024 INFO o.a.j.r.Summariser: summary +      9 in 00:00:05 =    1.9/s Avg:   447 Min:   295 Max:   937 Err:     9 (100.00%) Active: 0 Started: 10 Finished: 10
2026-04-07 01:04:05,024 INFO o.a.j.r.Summariser: summary =     10 in 00:00:05 =    1.9/s Avg:   454 Min:   295 Max:   937 Err:    10 (100.00%)